#include <Wire.h>
#include <Arduino.h>
#include <LiquidCrystal_I2C.h>

// символы для больших цифр
byte slash_r[] = {B00011,B00111,B00111,B01111,B11110,B11100,B11100,B11000};
byte slash_l[] = {B11000,B11100,B11100,B11110,B01111,B00111,B00111,B00011};
byte up[]      = {B11111,B11111,B11111,B11111,B00000,B00000,B00000,B00000};
byte down[]    = {B00000,B00000,B00000,B00000,B11111,B11111,B11111,B11111};
byte tri_rd[]  = {B00001,B00011,B00011,B00111,B00111,B01111,B01111,B11111};
byte tri_ru[]  = {B11111,B11110,B11110,B11100,B11100,B11000,B11000,B10000};
byte tri_ld[]  = {B10000,B11000,B11000,B11100,B11100,B11110,B11110,B11111};
byte tri_lu[]  = {B11111,B01111,B01111,B00111,B00111,B00011,B00011,B00001};

//символы цифр 4 на 4
int custom_nums[10][4][4] = {   
                                {   
                                    {4, 2, 2, 6},
                                    {8, 9, 9, 8},
                                    {8, 9, 9, 8},
                                    {7, 3, 3, 5}// 0
                                },
                                {   
                                    {9, 9, 0, 6},
                                    {9, 0, 9, 8},
                                    {9, 9, 9, 8},
                                    {9, 9, 9, 8}// 1
                                },
                                {   
                                    {4, 8, 8, 6},
                                    {9, 9, 4, 5},
                                    {9, 4, 5, 9},
                                    {4, 8, 8, 6}// 2
                                },
                                {   
                                    {4, 8, 8, 6},
                                    {9, 9, 4, 5},
                                    {9, 9, 7, 6},
                                    {7, 8, 8, 5}// 3
                                },
                                {   
                                    {9, 8, 9, 8},
                                    {9, 7, 3, 8},
                                    {9, 9, 9, 8},
                                    {9, 9, 9, 8}// 4
                                },
                                {   
                                    {4, 2, 2, 2},
                                    {7, 6, 9, 9},
                                    {9, 2, 2, 6},
                                    {3, 3, 3, 5}// 5
                                },
                                {   
                                    {0, 2, 2, 1},
                                    {1, 3, 3, 9},
                                    {0, 2, 2, 1},
                                    {1, 3, 3, 0}// 6
                                },
                                {   
                                    {4, 8, 8, 6},
                                    {9, 9, 4, 5},
                                    {9, 4, 5, 9},
                                    {4, 5, 9, 9}// 7
                                },
                                {   
                                    {0, 2, 2, 1},
                                    {1, 3, 3, 0},
                                    {0, 2, 2, 1},
                                    {1, 3, 3, 0}// 8
                                },
                                {   
                                    {9, 0, 2, 1},
                                    {9, 1, 3, 0},
                                    {9, 9, 0, 9},
                                    {9, 0, 9, 9}// 9
                                }
};


int custom_letters[1][4][4] = {   
                                {   
                                    {2, 2, 2, 5},
                                    {9, 9, 0, 9},
                                    {9, 0, 9, 9},
                                    {4, 3, 3, 3}// z
                                },

};

// регистрация кастомных символов
void register_custom_symbols(LiquidCrystal_I2C &lcdt){
    lcdt.createChar(0, slash_r);
    lcdt.createChar(1, slash_l);
    lcdt.createChar(2, up);
    lcdt.createChar(3, down);
    lcdt.createChar(4, tri_rd);
    lcdt.createChar(5, tri_ru);
    lcdt.createChar(6, tri_ld);
    lcdt.createChar(7, tri_lu);
}